[
    {
        "pk": 1,
        "model": "team.Player",
        "fields": {
            "name": "Kristin Aloi",
            "position": "AA",
            "year": "Sr.",
            "hometown": "Winston Salem, N.C.",
            "high_school": "Mount Tabor",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/VD/VDLSJRPEQPKBXWO.20131127180056.jpg",
            "story": "Inducted into Phi Beta Kappa, the prestigious academic honorary society, in December, 2013 •   Graduated from school last May and is currently enrolled in the UNC Pharmacy School • Will compete as a graduate student in 2014. As a JuniorMissed the 2013 season while recovering from foot injury • Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team. As a SophomoreNamed an Arthur Ashe Scholar Award winner • Earned EAGL All-Academic honors • Competed in nine meets, primarily on vault, balance beam and floor exercise • Won the individual title on vault at George Washington with a 9.775 and also placed second at that meet on floor with a 9.750 • Captured the floor exercise title the following week vs. William & Mary with a 9.850 • Also registered an all-around score of 36.800 against W&M • Had a career-best 9.875 on floor vs. George Washington on Feb. 24 • Named second-team All-EAGL on floor. As a FreshmanCompeted in all 11 meets as a member of the vault, balance beam and floor exercise lineups • Earned first-team All-EAGL Tournament honors on floor exercise and was second team on balance beam • At the EAGL meet, she posted a fifth place finish (9.850) on floor and a ninth place finish (9.750) on beam • Also had a season-high 9.750 on vault as Carolina won its second consecutive EAGL crown • Won the individual balance beam event vs. William & Mary with a personal-best 9.775 • Earlier in the year, she also posted a 9.775 on beam at West Virginia • Had a career-best 9.875 to win the floor exercise title vs. Pittsburgh • Also won individual floor exercise events at William & Mary and vs. Maryland • Finished sixth on floor with a 9.850 at the NCAA regionals in Norman, Okla. • Received EAGL All-Academic honors. Prep:Attended Mount Tabor High School in Winston-Salem, N.C...Trained at High Point Gymnastics Academy from 2008-2010...From 2006-2008 trained at Salem Gymnastics Sports Center...Chosen to the Regional All-Star Team...Junior Olympic Nationals Team Champions 2010...Team Captain junior and senior years of highschool...Junior Olympic Nationals Qualifier...State Champion in beam, floor and All-Around. Personal:Daughter of Gigi and Matt Aloi...Born September 22, 1991 in Daytona Beach, FL...Has one brother...High School Class Valedictorian...First gymnastics competition when she was 8-years-old was in Fetzer gymnasium. Kristin Aloi's Personal Bests Vault: 9.800 - 3/10/12 (2 times) - most recently on 3/10/12 vs. Ohio State Balance Beam: 9.775 (2 times) most recently on 3/5/11 in Chapel Hill, N.C. Floor Exercise: 9.875 (3 times) - most recently on 3/2/12 at State College, Pa. Getting To Know Kristin: Nickname: ‘Loi Major: Pharmacy/Psychology Career Plans: Clinical Pharmacy Practitioner What is the best thing about being at UNC? The amazing spirit of the student body Away from gymnastics and my academic pursuits, I like to spend time… trying to learn how to play the guitar and harp My greatest strength as a gymnast is… my perseverance Biggest sports thrill and why? Winning conference as a team my freshman year Person who had the greatest influence on your career and why: My parents for always encouraging me no matter what Favorite Food: Sinigang (Filipino food) Funny or interesting fact about yourself: I am obsessed with the color red Favorite class at UNC and why: African-American psychology At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? Eight years old; Peeling off the low bar and landing on my face The funniest nickname on the team belongs to: Megan (M&M) What song would you sing if you were on American Idol? Burn by Usher What reality show would you most like to be on? Cupcake Wars My favorite guilty pleasure is: The cooking channel If I could go to dinner with one famous person it would be: James Franco The most interesting person I’ve met at UNC is: Jackie Chang People say I look like: N/A Favorite place to visit: Thailand"
        }
    },
    {
        "pk": 2,
        "model": "team.Player",
        "fields": {
            "name": "Margaret Brown",
            "position": "AA",
            "year": "Fr.",
            "hometown": "Waxhaw, N.C.",
            "high_school": "Cuthbertson",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/IJ/IJPTHEHODHWRTYF.20131127180056.jpg",
            "story": "Prep: Trained at Southeastern Gymnastics in Weddington, N.C., under the direction of Ludmilla Shobe • Placed third on floor, sixth on beam and sixth in the all-around at the Level 10 state championships • Missed most of her 2012 season with elbow surgery • Was a Level 10 performer at the states, finishing third on uneven bars and fifth on balance beam • Attended Cuthbertson High School where she was a member of the National Honor Society • Member of the Fellowship of Christian Athletes • Volunteer at several community events, including Fixing it Up For Christ, Elevation Church, Girls on the Run and the Henderson County Special Olympics.Getting To Know Margaret:Nickname: Margie/ Brownie Major: Exercise and Sports ScienceCareer Plans: Physicians Assistant What is the best thing about being at UNC? Making so many great memories with my teammates Away from gymnastics and my academic pursuits, I like to spend time… with my friends or sleepingMy greatest strength as a gymnast is… catching onto new skills quickly and making corrections Biggest sports thrill and why? Performing a floor routine in competition. It’s when you can go all out and put on a show Person who had the greatest influence on your career and why: My parents, because they’ve supported me through gymnastics all these years Favorite Book: The Harry Potter series Favorite Food: Ice cream and sushi Funny or interesting fact about yourself: I can do a rainbow with a soccer ball At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? 3; My earliest memory is being the first one on my team to do a kip The funniest nickname on the team belongs to: Sarah Peterson- Frisker What song would you sing if you were on American Idol? Hold On We’re Going Home by Drake (Duet with Christina) What reality show would you most like to be on? Wipeout My favorite guilty pleasure is: Double chocolate dining hall cookies If I could go to dinner with one famous person it would be: Justin Timberlake The most interesting person I’ve met at UNC is: Leslie Cloots Favorite place to visit: Hilton Head Island"
        }
    },
    {
        "pk": 3,
        "model": "team.Player",
        "fields": {
            "name": "Lexi Cappalli",
            "position": "AA",
            "year": "So.",
            "hometown": "Kildeer, Ill.",
            "high_school": "Adlai E. Stevenson",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/ZY/ZYJEMBOGCNECEZF.20131127180056.jpg",
            "story": "Enters the 2014 season looking to improve on a solid rookie campaign • Has the ability to be an all-around after focusing primarily on vault, bars and floor a year ago. As A Freshman Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team • Competed in all 12 events, primarily on vault, bars and floor exercise • Also competed on beam in one meet • Scored a season-high 9.825 on vault to finish fifth against George Washington and William & Mary • Set a season-high on floor in three different meets with a score of 9.850 at the EAGL championships, vs. Penn and at Pitt • Posted a season-best 9.850 on uneven bars at Oklahoma • Won the floor competition at home vs. Penn and was second on floor at the EAGL to capture All-conference tournament honors. Prep: Attended Adlai E. Stevenson High School in Lincolnshire, Ill...Trained under the guidance of head coach Todd Gardiner at Illinois Gymnastics Institute...Junior Olympic Nationals Qualifier 2010...Placed second on vault and fifth in the all-around at the V Region Championships in 2010. Personal Bests: Vault: 9.825 - 2/2/13 vs. Maryland Uneven Bars: 9.850 - 3/10/13 at Oklahoma; 3/16/13 vs. Penn Floor Exercise: 9.850 - 3/2/13 at Pitt; 3/16/13 vs. Penn; 3/23/13 at EAGL championships  Getting To Know Lexi:  Nickname: Lex Major: Chemistry Career Plans: Still a work in progress What is the best thing about being at UNC? UNC has the perfect balance of athletics and academics, and the sports atmosphere is electric Away from gymnastics and my academic pursuits, I like to spend time… Cooking, reading and hanging with my teammates My greatest strength as a gymnast is… floor. It’s a place where I can perform to the fullest Biggest sports thrill and why: If the Cubs ever won the World Series, I would need nothing else in life Person who had the greatest influence on your career and why: My parents have always been there for guidance, support and a nudge in the right direction Favorite Book: A Little Princess Favorite Food: Ribs Funny or interesting face about yourself: I can shoot a 3-pointer with nothing but net Favorite class at UNC and why: History 89, it made me look at history in a much different way At what age did you start participating in gymnastics and what is your earliest memory of gymnastics? 2. My earliest memory is learning to jump to the high bar and being scared to do it The funniest nickname on the team belongs to: Sarah- Frisk What song would you sing if you were on American Idol? If I could sing like Michael Buble, I’d sing The Way You Look Tonight by Frank Sinatra What reality show would you most like to be on? Top Chef- as a judge My favorite guilty pleasure is: Chocolate and People magazine If I could go to dinner with one famous person it would be: Johnathen Toews The most interesting person I’ve met at UNC is: Elizabeth Mallett- my English golfer roomie from freshman year People say I look like… Jordyn Weiber Favorite place to visit: Home"
        }
    },
    {
        "pk": 4,
        "model": "team.Player",
        "fields": {
            "name": "Acacia Cosentino",
            "position": "UB, FX",
            "year": "Sr.",
            "hometown": "Chagrin Falls, Ohio",
            "high_school": "Lakota West",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/MQ/MQSGIZZODICUIKS.20131127180056.jpg",
            "story": "Will compete primarily on uneven bars and floor exercise this season. As a Junior Missed the season with an Achilles' injury that required surgery in January • Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team. As a Sophomore Competed in all 11 events primarily on bars • Also competed on vault in one meet and floor exercise in one meet • Posted a 9.750 to finish third vs. Temple • Finished fourth on bars with a 9.725 vs. George Washington on Feb. 24. As a Freshman Competed in eight meets, primarily as a member of the vault lineup • Also competed in three meets on floor • Posted her two top scores of the season at the NCAA regional in Norman, Okla., with a 9.600 on vault and a 9.725 on floor • Finished seventh on vault in a dual meet with William & Mary • Received EAGL All-Academic honors. Prep: Attended Lakota West High School in West Chester, Ohio...Trained at Cincinnati Gymnastics Academy from 2006-2010 under Enrique Trabanino and Kim Albrecht...Level 10 Ohio State Team Champions 2006-2010...All-around, beam and bars champion 2010...Region 5 beam Champion 2009...Qualified to Junior Olympic Level 10 Nationals in 2007, 2009-10...Part of team that won Junior Olympic Nationals in 2007...Team Captain in 2009 and 2010. Personal: Daughter of Renee and Len Cosentino...Born May 12, 1992 in Cleveland, Ohio...Has three sisters and one brother. Acacia Cosentino's Personal Bests Vault: 9.600 - 4/2/11 - Norman, Okla. Uneven Bars: 9.750 - 2/17/12 - Chapel Hill, N.C. Floor Exercise: 9.725 - 4/2/11 - Norman, Okla. Getting To Know Acacia:  Nickname: Caish Major: Double major in English and Philosophy Career Plans: Teaching or advising What is the best thing about being at UNC? The Tar Heel family Away from gymnastics and academic pursuits, I like to spend time… Cooking, watching Disney movies, going to Athletes in Action, and trying new restaurants and sing alongs. My greatest strength as a gymnast is… persevering through adversity Biggest sports thrill and why? 2011 UNC Men’s Soccer National Championship Person who had the greatest influence on your career and why: My parents because they are so selfless in helping me achieve my goals Favorite book: Jane Eyre by Charlotte Brante Favorite food: Cosentino pasta Funny or interesting fact about yourself: My nephew’s name is Dean Smith Favorite class at UNC and why: 19th Century British Literature because we read great novels At what age did you start participating in gymnastics and what is your earliest memory of gymnastics: Age 6, and I remember not knowing I was called up to the awards stand because my name was so badly mispronounced The funniest nickname on the team belongs to: Sarah Peterson- Pete What song would you sing if you were on American Idol: Bohemian Rhapsody by Queen What reality show would you most like to be on? Say Yes to the Dress My favorite guilty pleasure is: Peanut M&M’s If I could go to dinner with one famous person it would be: C.S. Lewis The most interesting person I’ve met at UNC is: Mike and Kim Echstenkamper People say I look like… a cartoon character Favorite place to visit: the beach"
        }
    },
    {
        "pk": 5,
        "model": "team.Player",
        "fields": {
            "name": "Michelle Ikoma",
            "position": "AA",
            "year": "RSr.",
            "hometown": "Naperville, Ill.",
            "high_school": "Naperville",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/SI/SIRQDWDCZTHIWCB.20131127180057.jpg",
            "story": "As a Junior Named one of 10 finalists for the 2013 Arthur Ashe Jr. Sports Scholar Award • Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team for the fourth straight season • Competed in all 12 meets primarily on vault, bars and floor exercise • Did not compete on bars until the fourth meet of the season • Hit a near flawless routine and posted a 9.850 to finish second at NC State • Won the bars event with a 9.80 at George Washington • Posted her season-best score on floor with a 9.850 at Pitt to tie for fourth place • Had a season-high 9.750 on vault in three meets, including the NCAA regionals and EAGL championships. As a Sophomore Named an Arthur Ashe Scholar Award winner • Earned EAGL All-Academic honors • Came back to the lineup to compete in nine events primarily in vault and floor • Scored a season-high 9.750 on floor exercise to finish sixth vs. Maryland • Scored a season-best 9.725 at the NCAA Regional. 2011 Ikoma tore the Achilles tendon in her right foot in practice in January just before the start of the 2011 season. She redshirted and will have three years of eligibility remaining. Ikoma has completely recovered and will be competing this season. As a Freshman Competed in all 11 events and was a valuable contributor on all events • Began the season with a fourth place finish on the uneven bars at the George Washington Invitational • Finished second on the vault with a 9.750 at William & Mary • Scored a season-high 9.775 and finish fourth on vault vs. Maryland • Competed in the all-around for the first time in her career at the Sweetheart Invitational and scored a 37.700 • Had a season-high 9.725 on bars and a personal-best 38.425 in all-around at Florida • Posted a season-best 9.775 on vault vs. West Virginia and a personal-best 9.775 on floor exercise vs. Rutgers • Received EAGL All-Academic honors. Prep: Trained with Dan & Beth Miller at Arena Gymnastics in Joliet, Ill. ... Attended Naperville Central High School in Naperville, Ill. ... 2007 and 2008 USA Gymnastics Junior Olympic Nationals qualifier ... Was the 2007 Region 5 all-around, balance beam and uneven bars champion ... Placed seventh on uneven bars and 14th in the all-around at the 2007 Junior Olympic National Championships ... Placed fourth on uneven bars, sixth on vault and sixth in the all-around at the 2008 USA Gymnastics Junior Olympic Level 10 Nationals. Personal: Daughter of Allan and Denise Ikoma ... Born on March 19, 1991 in Chicago, Ill. ... Given name is Michelle Mariko Ikoma ... Has a sister, Danielle (20) who is a member of the Stanford gymnastics team and a brother, Derek (15) ... Plans to major in biomedical engineering and economics ... Enjoys shopping, cryptograms and Dance Dance Revolution. Personal Bests Vault: 9.775 (twice) - most recently on 3/13/10 - Chapel Hill, N.C. Uneven Bars: 9.850 - 2/16/13 at NC State Balance Beam: 9.650 - 2/20/10 - Raleigh, N.C. Floor Exercise: 9.850 - 3/2/13 at Pitt  All-Around: 38.425 - 3/5/10 - Gainesville, Fla. Getting To Know Michelle:  Nickname: Mich, Michine Major: Business Administration, Exercise & Sports Science; Minor: Mathematics Career Plans: Short-Term: Earn a Master of Science in Data Analysis; Long-Term: Merge my interests in data analysis and rehabilitative medicine to help develop prosthetics that amputees can control just like their own arm/leg What is the best thing about being at UNC? Having an amazing family of people around you who are always there to support you and do anything they can to help you succeed My greatest strength as a gymnast is… My work ethic and enthusiasm Biggest sports thrill and why? Winning back-to-back EAGL Championships my freshman and sophomore year Person who had the greatest influence on your career and why: My sister, Danielle. Growing up, I always wanted to be just like her, and to this day, I know that I can always go to her for advice and support Favorite Book: My Sister’s Keeper by Jodi Picoult Funny or interesting fact about yourself: I was a “kid scientist” on the Late Show with David Letterman when I was in 8th grade Favorite class at UNC and why: EXSS 380- Neuromuscular Control and Training; I find it fascinating to learn about how basic components of the nervous system and muscular system work together seamlessly in everything we do without us even thinking about it.At what age did you start participating in gymnastics and what is your earliest memory of gymnastics? Age 3; I remember getting separated from my group when I was 4 or 5 and looking around in panic, then seeing my sister in her group (which was a completely different class), and then running over to join her The funniest nickname on the team belongs to: Megan- M&M What song would you sing if you were on American Idol? I can’t sing, so I would never be on American Idol to begin with, but I love the song “Hall of Fame” by The Script [feat. Will I Am] What reality show would you most like to be on? The Amazing Race My favorite guilty pleasure is: Bski’s warm chocolate chip cookies If I could go to dinner with one famous person it would be: Thomas Edison The most interesting person I’ve met at UNC is: Meredith Petschauer (I’m convinced she’s super woman because she does a billion different things, yet does them all well). People say I look like… Ashley Dai on the tennis team"
        }
    },
    {
        "pk": 5,
        "model": "team.Player",
        "fields": {
            "name": "Josselyn Mackey",
            "position": "AA",
            "year": "So.",
            "hometown": "Lee's Summit, Mo.",
            "high_school": "Lee's Summit Morth",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/MM/MMPOUVAEMBUTQCY.20131127180057.jpg",
            "story": "As a Freshman Selected to the EAGL All-Academic team • Competed in every meet on balance beam • Also was a regular in the uneven bars and vault lineup • Competed on floor in just two meets • Had her season-high score on vault with a 9.600 at home against George Washington and on the road at Maryland • Posted a season-best 9.800 on the balance beam to finish second in the home meet vs. Maryland • Showed steady progress on the uneven bars and posted season-highs of 9.800 in back-to-back meets against Oklahoma and Penn. Prep: Attended Lee's Summit North High School in Lee's Summit, Mo. • Trained at Xtreme Gymnastics under the guidance of Alisha Robinson • Four-time Junior Olympic National Qualifier • Placed second at the 2012 Junior Olympic national championships • Placed sixth on balance beam at the 2011 National Championships • Placed 10th on balance beam and 12th in the all-around at 2010 National Championships. Personal Bests: Vault: 9.600 - 1/26 at Maryland Uneven Bars: 9.800 - 3/10/13 at Oklahoma; 3/16/13 vs. Penn Balance Beam: 9.800 - 2/2/13 vs. Maryland Getting To Know Josselyn:  Nickname: Joss Major: undecided Career Plans: undecided What is the best thing about being at UNC? Carolina Blue Away from gymnastics and my academic pursuits, I like to spend time… with my teammates My greatest strength as a gymnast is: Loving the sport even when things get hard and frustrating Biggest sports thrill and why? Competing for UNC Person who had the greatest influence on your career and why: Parents. They were always supportive no matter how well I did. Favorite Book: Anything turned into a movie so I don’t have the read the book Favorite Food: Breakfast food Funny or interesting fact about yourself: I am absolutely terrible at any other sport Favorite class at UNC and why: Practice- It’s the best part of my day At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? I’ve been in the gym as long as I can remember. I remember practicing backhand springs at home on my trampoline The funniest nickname on the team belongs to: Sarah Peterson- Frisk What song would you sing if you were on American Idol? N/A What reality show would you most like to be on? Wipeout My favorite guilty pleasure is: napping If I could go to dinner with one famous person it would be: Ashton Kutcher The most interesting person I’ve met at UNC is: the pit preacher People say I look like… Haley Watts Favorite place to visit: the beach"
        }
    },
    {
        "pk": 6,
        "model": "team.Player",
        "fields": {
            "name": "Meredith Magjuka",
            "position": "BB, FX",
            "year": "RSr.",
            "hometown": "Greenwood, Ind.",
            "high_school": "Center Grove",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/GW/GWOJWYZKVZIHFXH.20131127180057.jpg",
            "story": "As a Junior Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team for the fourth straight season • Competed in all 12 meets primarily on vault, balance beam and floor exercise • Had her best meet of the season at home vs. Maryland with season highs on the vault (9.700) and floor (9.800) • Posed a season-best 9.850 on the balance beam against NC State and Pitt to finish third • Also placed third on balance beam with a 9.750 at George Washington in the first meet of the season. As a Sophomore Competed on floor exercise in three meets - at George Washington, vs. William & Mary and at Alabama • Scored a season-best 9.100 on floor at George Washington • Earned EAGL All-Academic honors. As a Freshman Competed in four meets after returning to competitive action following a redshirt season in 2010 • Competed on vault and floor at the first two meets of the season at the George Washington Invitational and at Rutgers • Was part of the floor lineup at William & Mary and at home vs. Maryland • Scored a personal-best 9.575 on floor at Rutgers • Posted a season-high 9.500 at George Washington • Received EAGL All-Academic honors. In 2010 Redshirted in 2010 after fracturing a vertebrae in her back • Competed on uneven bars and balance beam at George Washington Invitational and William & Mary prior to the injury • Scored personal-bests on bars (9.650) and balance beam (9.650) in George Washington Invitational. Prep: A top student at Center Grove High School ... Trained under the guidance of Michelle Hart and Casey Wright at Wright's Gymnastics Academy in Greenwood, Ind. ... Three-time USA Gymnastics Junior Olympic National Champion ... Achieved the ultimate as a Level 10 gymnast competitively at the 2007 Junior Olympic National Championships when she won the floor exercise title ... Repeated that achievement, and even went a step further, in 2008 when she was crowned as the floor exercise and all-around champion at the USA Gymnastics Junior Olympic National Championships. Personal: Daughter of Rich and Annette Magjuka ... Born on November 11, 1990 in Greenwood, Ind. ... Given name is Meredith Anne Magjuka ... Has one sister, Marianne and one brother, David ... Enjoys cooking and watching football with her dad ... Enrolled in General College. Personal Bests Uneven Bars: 9.650 - 1/17/10 - Washington, D.C. Balance Beam: 9.850 - 2/16/13 - at NC State Vault: 9.7000 - 2/2/13 - vs. Maryland Floor: 9.800 - 2/2/13 - vs. Maryland Getting To Know Meredith:  Major: Business Administration Career Plans: Consulting Best thing about UNC: The diversity of opportunities available I like to spend my free time… doing hot yoga and cooking My greatest strength as a gymnast… resiliency Biggest sports thrill… winning J.O. nationals Person with the greatest influence on your career: My family for always supporting and loving me unconditionally Favorite Book: Crime and Punishment Favorite Food: Spaghetti Squash Funny Fact: I can’t ride a bike Favorite Class: Environmental Justice What age did you start participating in gymnastics: 2 What song would you sing if you were on American Idol? I really can’t sing If I could go to dinner with one famous person it would be: Martin Luther King Jr. Favorite place to visit: Home"
        }
    },
    {
        "pk": 7,
        "model": "team.Player",
        "fields": {
            "name": "Megan Marenghi",
            "position": "UB, BB",
            "year": "Fr.",
            "hometown": "Plano, Texas",
            "high_school": "",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/EA/EASPLHGYHXVSREB.20131127180057.jpg",
            "story": "Prep: An accomplished Level 10 gymnast and a strong student • Trained at Zenith Elite Gymnastics in Plano, Texas, with coaches Tatiana Schegolkova and Alex Atamas • Excelled on balance beam and uneven bars • A USA Gymnastics Junior Olympic National Team Member in 2010 and 2011 • Was the 2010 national champion on balance beam and also placed second on uneven bars and fourth in the all-around • Was the 2011 USA Gymnastics Region III all-around, uneven bars and balance beam champion • Placed second in the all-around, fourth on balance beam and sixth on uneven bars at the 2011 USA Gymnastics Junior Olympic National Championships. *** Getting To Know Megan: Nickname: Meg, Eminem Major: Global Studies Career Plans: Don’t know the specifics yet, but I definitely want a career in international relations, specifically America and the Middle East What is the best thing about being at UNC? Meeting new people and trying new things Away from gymnastics and my academic pursuits, I like to spend time… having fun with my friends and teammates My greatest strength as a gymnast is… rising to the occasion, performing under pressure Biggest sports thrill and why? Trying elite in 2012 because it was very gratifying to return to the level I was once at before having four knee surgeries Person who had the greatest influence on your career and why: My mom because she always helps me persevere and always gives me the best encouragement Favorite Book: The Hunger Games Favorite Food: Lobsters and mussels Funny or interesting fact about yourself: I can palm a basketball Favorite class at UNC and why: ENGL 72, which is a first year seminar about the literature of 9/11. I like learning about the relation between the U.S. and Middle East At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? 2; punching the beam when I would fall The funniest nickname on the team belongs to: Margaret Brown- Brownie What song would you sing if you were on American Idol? Rap God-Eminem What reality show would you most like to be on? Basketball Wives My favorite guilty pleasure is: coffee If I could go to dinner with one famous person it would be: Definitely Tom Brady The most interesting person I’ve bet at UNC is: My roommate Leslie Cloots who is a golfer from Belgium People say I look like: I’m just really unique I guess Favorite place to visit: Maui"
        }
    },
    {
        "pk": 8,
        "model": "team.Player",
        "fields": {
            "name": "Sarah Peterson",
            "position": "AA",
            "year": "So.",
            "hometown": "Huntington, N.Y.",
            "high_school": "Elwood/John Glenn",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/VO/VORSUWQJSZMXQQB.20131127180057.jpg",
            "story": "As a Freshman Competed in all 12 meets in at least two events • Was a regular member of the vault and floor lineups • Posted her best score of the season on uneven bars with a 9.775 to finish fourth against Maryland and fifth at George Washington • Had a season-high 9.800 on vault against Maryland • Matched that score later in the season to finish tied for ninth at the EAGL championships • Scored a 9.825 on floor vs. Penn to take home third place honors. Prep: Attended Elwood/John Glenn High School in Elwood, N.Y...Trained at Mid Island Gymnastics under the direction of Travol Williams...Junior Olympic Nationals Qualifier 2010...Two-time Eastern Nationals Qualifier...Placed eighth in the all-around at the Eastern Nationals in 2009...Foot injury in 2011 that kept her from completing the competitive season. Personal Bests: Vault: 9.800 - 3/2/13 vs. Maryland; 3/23/13 at EAGL championships Uneven Bars: 9.775 - 1/20/13 vs. George Washington; 3/2/13 vs. Maryland Floor Exercise: 9.825 - 3/16/13 vs. Penn Getting to Know Sarah:  Nickname: Frisk/ Pete What is the best thing about being at UNC? Meeting new people Away from gymnastics and my academic pursuits, I like to spend time… With my friends My greatest strength as a gymnast is… staying calm Biggest sports thrill and why? Competing because I finally get a chance to show my routines that I have been training Favorite Book: The Hunger Games Favorite Food: Ice Cream At what age did you first participating in gymnastics and what is your earliest memory of gymnastics? 6; my first Girl Scout trip to the gym The funniest nickname on the team belongs to: Margie- Brownie What song would you sing if you were on American Idol? Born Stunna Remix What reality show would you most like to be on? The Bachelorette My favorite guilty pleasure is: reality TV If I could go to dinner with one famous person it would be: John Mayer (preferably a date) The most interesting person I’ve met at UNC is: The Joss Mackey Favorite place to visit: beach"
        }
    },
    {
        "pk": 9,
        "model": "team.Player",
        "fields": {
            "name": "Christina Pheil",
            "position": "AA",
            "year": "Fr.",
            "hometown": "St. Petersburg, FL",
            "high_school": "St. Petersburg",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/XG/XGVVMGKCUIEYTQC.20131127180057.jpg",
            "story": "Prep:Trained under the guidance of Brad Harris and Amy Schulthess at Tampa Bay Turners Gymnastics in St. Petersburg, Fla. • During her Junior Olympic career she was the Florida State all-around champion at every level for levels 4-10 • Was the 2009 USA Gymnastics Level 9 Eastern National all-around and uneven bars champion • Placed fourth on floor exercise and 19th in the all-around at the 2010 USA Gymnastics Junior Olympic Level 10 National Championships • Was the 2011 Junior Olympic National Invitational Tournament floor exercise champion. Getting to Know Christina: Nickname: Chris/Pheil Major: Exercise and Sports Science and Pre-Pharmacy Career Plans: Enter the pharmacy program at UNC and then pursue pharmacology What is the best thing about being at UNC? The spirit that everyone displays and how people care so deeply about this school Away from gymnastics and my academic pursuits, I like to spend time… playing other sports, listening to music and reading My greatest strength as a gymnast is… Being focused, composed and committed towards myself, but more importantly, to the team Biggest sports thrill and why? When someone nails a skill or routine…that gives me chills Person who had greatest influence on your career and why: My parents because no matter what, they are always support me, listening to me and encouraging me Favorite Book: The Great Gatsby Favorite Food: Sushi Funny or interesting fact about yourself: I can do donuts on a jet ski Favorite class at UNC and why: Philosophy 112 “Making Sense of Yourself” because the class makes me think of things I have never even thought about thinking about At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? 3 years old. My parents caught me climbing the refrigerator, and once I broke the handle they decided to put me in gymnastics The funniest nickname on the team belongs to: Sarah Peterson- Pete What song would you sing if you were on American Idol? Hold On We’re Going Home by Drake (Duet with Margie) What reality show would you most like to be on? Punk’dMy favorite guilty pleasure is: Christmas music If I could go to dinner with one famous person it would be: Harry Styles The most interesting person I’ve met at UNC is: Leslie Cloots People say I look like… Christina Pheil Favorite place to visit: St. Pete Beach"
        }
    },
    {
        "pk": 10,
        "model": "team.Player",
        "fields": {
            "name": "Janell Sargent",
            "position": "BB",
            "year": "Jr.",
            "hometown": "Greenville, N.C.",
            "high_school": "",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/UV/UVTCREJCKAUOSTW.20131127180057.jpg",
            "story": "As a Sophomore Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team • Competed in all 12 meets as a balance beam specialist • Posted a season-high 9.900 to finish second at NC State and Pittsburgh • Posted a score of 9.700 or higher in nine of 12 meets on beam • Tied for second in the beam competition in the meet at George Washington and at Pitt. As a Freshman Competed in seven meets as part of the balance beam lineup • Posted a season-best 9.750 in a road meet at Penn State and at the NCAA Regional in Raleigh • Also had a 9.725 on three occasions - vs. Temple on Feb. 17, George Washington on Feb. 24 and at the EAGL Championship on March 24 • Earned EAGL All-Academic honors. Prep Was one of the top Junior Olympic gymnasts in North Carolina for many years • Attended Roses' Gymnastics in Greenville, N.C., where she trained under the guidance of Darlene Rose, Colin Womack and Shelley Harris • Two-time USA Gymnastics Junior Olympic Level 10 National qualifier • Roses' training program has produced several outstanding student athletes that pursued their college experiences at Carolina. Personal Born Janell Elizabeth Sargent on January 1, 1993 in Minneapolis • Daughter of Andy and Pam Sargent • Was home schooled by her parents • Volunteered twice a month at Reimage Church in the children's curriculum • Played the violin as a child • Her father, Andy, is a chemistry professor at East Carolina University. Personal Bests: Balance Beam: 9.900 - 2/16/13 at NC State Getting To Know Janell:  Nickname: Nell Major: Exercise and Sports Science; Minor: Hispanic Studies Career Plans: Still praying about it What is the best thing about being at UNC? Getting to meet and befriend so many people! The is always someone to talk to Away from gymnastics and academic pursuits, I like to spend time… reading my Bible, praying, going to FCA, Summit and Bible Study, cooking with teammates, and going to other sporting events at UNC My greatest strength as a gymnast is… Being able to focus on what I’m doing in the gym. Being able to fully “zone in” on what I’m doing. Biggest sports thrill and why? Probably getting my first 38AA score in level 8. I was so excited to finally break through that 38.00 barrier, and it was a solid meet overall. I felt really good about it. Person who had the greatest influence on your career and why: There are so many people who have influenced my gymnastics career in big ways, but I want to give a shout out to my parents. They have sacrificed so much of their time and money to enable me to compete in gymnastics, have always been supportive, and have encouraged me to do my best while never ever forcing me to continue doing it. I am so grateful to them! Favorite book: the BibleFavorite food: Just about any kind of grilled vegetable, especially asparagusFunny or interesting fact about yourself: I only had 2 wisdom teeth that grew in and had to get taken out. My poor mom had 5, so we always joke that she took an extra of mine for me Favorite class at UNC and why: I love my EXSS 188 Emergency Care class. I am excited to keep learning about how to treat people and give proper care in emergency situations. I love feeling prepared to step up in these situations an be able to help people in every way that I can At what age did you start participating in gymnastics and what is your earliest memory of gymnastics? I started gymnastics at 3 ½. One of my earliest memories of gymnastics is coming into the gym with my teammates for very early-morning interviews/news specials featuring our local gym, Rose’s Gymnastics. I got so nervous about the interviews because I was extremely shy when I was younger, but I had fun coming in and doing gymnastics in the early morning with my team anyway! The funniest nickname on the team belongs to: Margaret- Brownie What song would you sing if you were on American Idol? The Motions b Matthew West What reality show would you most like to be on? I think it would be fun and very rewarding to be on the Extreme Makeover: Home Edition team My favorite guilty pleasure is: Any sort of ice cream with other things mixed in (brownie bites, cookie dough pieces, caramel swirl, etc.) If I could go to dinner with one famous person it would be: Alex Kendrick. He may not be super famous, but he has produced several movies (Facing the Giants, Fireproof, Flywheel and Courageous) of which I am a big fan! The most interesting person I’ve met at UNC is: Adeline Dorough- she always has so much energy. She also loved God and is just an awesome person People say I look like… My dad. People can always tell we’re related Favorite Place to visit: Maine and Texas, where my extended family lives"
        }
    },
    {
        "pk": 11,
        "model": "team.Player",
        "fields": {
            "name": "Haley Watts",
            "position": "AA",
            "year": "Jr.",
            "hometown": "Charlotte, N.C.",
            "high_school": "Providence",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/FV/FVCWIDURUBFOLEG.20131127180057.jpg",
            "story": "One of the most consistent performers on the team • Had a strong sophomore season and has a bright future. As a Sophomore Battled teammate Elizabeth Durkac for top all-around scores every week • Took home EAGL Gymnast of the Week honors after posting a 39.225 in the all-around competition vs. Maryland to finish first • Also scored more than a 39.0 in the all-around at NC State, at Oklahoma, vs. Penn and at the EAGL championships • Scored a 39.0 at both the EAGL championships and the NCAA regionals to place ninth in both meets • Scored season-highs on vault (9.850) and floor (9.850) against the Terps • Finished first on the floor in that meet • Also had a 9.850 on floor at NC State • Recorded season-highs on bars with a 9.850 at Oklahoma at vs. Penn • Finished in second place on bars vs. the Quakers • Had a season-high 9.775 on balance beam in two different meets. As a Freshman Competed in all 11 meets • Competed on balance beam, floor exercise and vault • Had her best meet at the NCAA Regional in Raleigh with season-highs on vault (9.775) and balance beam (9.750) • Had a season-high 9.825 on floor exercise to place eighth at Penn State • Finished fourth vs. William & Mary with a 9.750 on floor exercise. Prep Has been one of the top gymnasts in North Carolina for the past several years • Trained under the direction of Ludmilla Shobe at Southeastern Gymnastics • Has been involved in gymnastics since the age of 3 • Was a 2008, 2009, and 2010 Level 10 Junior Olympic National Qualifier • Placed 10th in the All-Around in 2008 & 2009, and she finished fifth in the All-Around in 2010 at the USA Gymnastics Junior Olympic National Championships. Personal Born Haley Brook Watts on September 19, 1993 in Lexington, N.C. • Daughter of Laura Lilly and Kevin Watts. Personal Bests: Vault: 9.850 - 2/2/13 vs. Maryland Uneven Bars: 9.850 - 3/10/13 at Oklahoma; 3/16/13 vs. Penn Balance Beam: 9.775 - 1/20/13 vs. George Washington; 3/23/13 at EAGL championships Floor Exercise: 9.850 - 2/2/13 vs. Maryland; 2/16/13 at NC State All-Around: 39.225 - 2/2/13 vs. Maryland Getting To Know Haley:  Major: Communications Career Plans: Elementary school teacher What is the best thing about being at UNC? All the great memories we are making Away from gymnastics and my academic pursuits, I like to spend time… with friends My greatest strength as a gymnast is… staying calm Biggest sports thrill and why? N/A Person who had the greatest influence on your career and why: My mom, she has always been there to support me Favorite Book: The Girl with the Dragon Tattoo Favorite Food: Oodles n Noodles Funny or interesting fact about yourself: N/A Favorite class at UNC and why: COMM 260- Performance and Social Change because we get to freely address controversial issues At what age did you start participating in gymnastics and what is your earliest memory of gymnastics? 3; I remember my first meet where I missed the vault The funniest nickname on the team belongs to: Frisk What song would you sing if you were on American Idol? Born Stunna Remix by Birdman ft. Nicki Minaj What reality show would you most like to be on? Duck Dynasty My favorite guilty pleasure is: sleeping If I could go to dinner with one famous person it would be: Future People say I look like… Josselyn Mackey Favorite place to visit: any place relaxing"
        }
    }
][
    {
        "pk": 1,
        "model": "team.Player",
        "fields": {
            "name": "Kristin Aloi",
            "position": "AA",
            "year": "Sr.",
            "hometown": "Winston Salem, N.C.",
            "high_school": "Mount Tabor",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/VD/VDLSJRPEQPKBXWO.20131127180056.jpg",
            "story": "Inducted into Phi Beta Kappa, the prestigious academic honorary society, in December, 2013 •   Graduated from school last May and is currently enrolled in the UNC Pharmacy School • Will compete as a graduate student in 2014. As a JuniorMissed the 2013 season while recovering from foot injury • Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team. As a SophomoreNamed an Arthur Ashe Scholar Award winner • Earned EAGL All-Academic honors • Competed in nine meets, primarily on vault, balance beam and floor exercise • Won the individual title on vault at George Washington with a 9.775 and also placed second at that meet on floor with a 9.750 • Captured the floor exercise title the following week vs. William & Mary with a 9.850 • Also registered an all-around score of 36.800 against W&M • Had a career-best 9.875 on floor vs. George Washington on Feb. 24 • Named second-team All-EAGL on floor. As a FreshmanCompeted in all 11 meets as a member of the vault, balance beam and floor exercise lineups • Earned first-team All-EAGL Tournament honors on floor exercise and was second team on balance beam • At the EAGL meet, she posted a fifth place finish (9.850) on floor and a ninth place finish (9.750) on beam • Also had a season-high 9.750 on vault as Carolina won its second consecutive EAGL crown • Won the individual balance beam event vs. William & Mary with a personal-best 9.775 • Earlier in the year, she also posted a 9.775 on beam at West Virginia • Had a career-best 9.875 to win the floor exercise title vs. Pittsburgh • Also won individual floor exercise events at William & Mary and vs. Maryland • Finished sixth on floor with a 9.850 at the NCAA regionals in Norman, Okla. • Received EAGL All-Academic honors. Prep:Attended Mount Tabor High School in Winston-Salem, N.C...Trained at High Point Gymnastics Academy from 2008-2010...From 2006-2008 trained at Salem Gymnastics Sports Center...Chosen to the Regional All-Star Team...Junior Olympic Nationals Team Champions 2010...Team Captain junior and senior years of highschool...Junior Olympic Nationals Qualifier...State Champion in beam, floor and All-Around. Personal:Daughter of Gigi and Matt Aloi...Born September 22, 1991 in Daytona Beach, FL...Has one brother...High School Class Valedictorian...First gymnastics competition when she was 8-years-old was in Fetzer gymnasium. Kristin Aloi's Personal Bests Vault: 9.800 - 3/10/12 (2 times) - most recently on 3/10/12 vs. Ohio State Balance Beam: 9.775 (2 times) most recently on 3/5/11 in Chapel Hill, N.C. Floor Exercise: 9.875 (3 times) - most recently on 3/2/12 at State College, Pa. Getting To Know Kristin: Nickname: ‘Loi Major: Pharmacy/Psychology Career Plans: Clinical Pharmacy Practitioner What is the best thing about being at UNC? The amazing spirit of the student body Away from gymnastics and my academic pursuits, I like to spend time… trying to learn how to play the guitar and harp My greatest strength as a gymnast is… my perseverance Biggest sports thrill and why? Winning conference as a team my freshman year Person who had the greatest influence on your career and why: My parents for always encouraging me no matter what Favorite Food: Sinigang (Filipino food) Funny or interesting fact about yourself: I am obsessed with the color red Favorite class at UNC and why: African-American psychology At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? Eight years old; Peeling off the low bar and landing on my face The funniest nickname on the team belongs to: Megan (M&M) What song would you sing if you were on American Idol? Burn by Usher What reality show would you most like to be on? Cupcake Wars My favorite guilty pleasure is: The cooking channel If I could go to dinner with one famous person it would be: James Franco The most interesting person I’ve met at UNC is: Jackie Chang People say I look like: N/A Favorite place to visit: Thailand"
        }
    },
    {
        "pk": 2,
        "model": "team.Player",
        "fields": {
            "name": "Margaret Brown",
            "position": "AA",
            "year": "Fr.",
            "hometown": "Waxhaw, N.C.",
            "high_school": "Cuthbertson",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/IJ/IJPTHEHODHWRTYF.20131127180056.jpg",
            "story": "Prep: Trained at Southeastern Gymnastics in Weddington, N.C., under the direction of Ludmilla Shobe • Placed third on floor, sixth on beam and sixth in the all-around at the Level 10 state championships • Missed most of her 2012 season with elbow surgery • Was a Level 10 performer at the states, finishing third on uneven bars and fifth on balance beam • Attended Cuthbertson High School where she was a member of the National Honor Society • Member of the Fellowship of Christian Athletes • Volunteer at several community events, including Fixing it Up For Christ, Elevation Church, Girls on the Run and the Henderson County Special Olympics.Getting To Know Margaret:Nickname: Margie/ Brownie Major: Exercise and Sports ScienceCareer Plans: Physicians Assistant What is the best thing about being at UNC? Making so many great memories with my teammates Away from gymnastics and my academic pursuits, I like to spend time… with my friends or sleepingMy greatest strength as a gymnast is… catching onto new skills quickly and making corrections Biggest sports thrill and why? Performing a floor routine in competition. It’s when you can go all out and put on a show Person who had the greatest influence on your career and why: My parents, because they’ve supported me through gymnastics all these years Favorite Book: The Harry Potter series Favorite Food: Ice cream and sushi Funny or interesting fact about yourself: I can do a rainbow with a soccer ball At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? 3; My earliest memory is being the first one on my team to do a kip The funniest nickname on the team belongs to: Sarah Peterson- Frisker What song would you sing if you were on American Idol? Hold On We’re Going Home by Drake (Duet with Christina) What reality show would you most like to be on? Wipeout My favorite guilty pleasure is: Double chocolate dining hall cookies If I could go to dinner with one famous person it would be: Justin Timberlake The most interesting person I’ve met at UNC is: Leslie Cloots Favorite place to visit: Hilton Head Island"
        }
    },
    {
        "pk": 3,
        "model": "team.Player",
        "fields": {
            "name": "Lexi Cappalli",
            "position": "AA",
            "year": "So.",
            "hometown": "Kildeer, Ill.",
            "high_school": "Adlai E. Stevenson",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/ZY/ZYJEMBOGCNECEZF.20131127180056.jpg",
            "story": "Enters the 2014 season looking to improve on a solid rookie campaign • Has the ability to be an all-around after focusing primarily on vault, bars and floor a year ago. As A Freshman Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team • Competed in all 12 events, primarily on vault, bars and floor exercise • Also competed on beam in one meet • Scored a season-high 9.825 on vault to finish fifth against George Washington and William & Mary • Set a season-high on floor in three different meets with a score of 9.850 at the EAGL championships, vs. Penn and at Pitt • Posted a season-best 9.850 on uneven bars at Oklahoma • Won the floor competition at home vs. Penn and was second on floor at the EAGL to capture All-conference tournament honors. Prep: Attended Adlai E. Stevenson High School in Lincolnshire, Ill...Trained under the guidance of head coach Todd Gardiner at Illinois Gymnastics Institute...Junior Olympic Nationals Qualifier 2010...Placed second on vault and fifth in the all-around at the V Region Championships in 2010. Personal Bests: Vault: 9.825 - 2/2/13 vs. Maryland Uneven Bars: 9.850 - 3/10/13 at Oklahoma; 3/16/13 vs. Penn Floor Exercise: 9.850 - 3/2/13 at Pitt; 3/16/13 vs. Penn; 3/23/13 at EAGL championships  Getting To Know Lexi:  Nickname: Lex Major: Chemistry Career Plans: Still a work in progress What is the best thing about being at UNC? UNC has the perfect balance of athletics and academics, and the sports atmosphere is electric Away from gymnastics and my academic pursuits, I like to spend time… Cooking, reading and hanging with my teammates My greatest strength as a gymnast is… floor. It’s a place where I can perform to the fullest Biggest sports thrill and why: If the Cubs ever won the World Series, I would need nothing else in life Person who had the greatest influence on your career and why: My parents have always been there for guidance, support and a nudge in the right direction Favorite Book: A Little Princess Favorite Food: Ribs Funny or interesting face about yourself: I can shoot a 3-pointer with nothing but net Favorite class at UNC and why: History 89, it made me look at history in a much different way At what age did you start participating in gymnastics and what is your earliest memory of gymnastics? 2. My earliest memory is learning to jump to the high bar and being scared to do it The funniest nickname on the team belongs to: Sarah- Frisk What song would you sing if you were on American Idol? If I could sing like Michael Buble, I’d sing The Way You Look Tonight by Frank Sinatra What reality show would you most like to be on? Top Chef- as a judge My favorite guilty pleasure is: Chocolate and People magazine If I could go to dinner with one famous person it would be: Johnathen Toews The most interesting person I’ve met at UNC is: Elizabeth Mallett- my English golfer roomie from freshman year People say I look like… Jordyn Weiber Favorite place to visit: Home"
        }
    },
        "pk": 4,
        "model": "team.Player",
        "fields": {
            "name": "Acacia Cosentino",
            "position": "UB, FX",
            "year": "Sr.",
            "hometown": "Chagrin Falls, Ohio",
            "high_school": "Lakota West",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/MQ/MQSGIZZODICUIKS.20131127180056.jpg",
            "story": "Will compete primarily on uneven bars and floor exercise this season. As a Junior Missed the season with an Achilles' injury that required surgery in January • Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team. As a Sophomore Competed in all 11 events primarily on bars • Also competed on vault in one meet and floor exercise in one meet • Posted a 9.750 to finish third vs. Temple • Finished fourth on bars with a 9.725 vs. George Washington on Feb. 24. As a Freshman Competed in eight meets, primarily as a member of the vault lineup • Also competed in three meets on floor • Posted her two top scores of the season at the NCAA regional in Norman, Okla., with a 9.600 on vault and a 9.725 on floor • Finished seventh on vault in a dual meet with William & Mary • Received EAGL All-Academic honors. Prep: Attended Lakota West High School in West Chester, Ohio...Trained at Cincinnati Gymnastics Academy from 2006-2010 under Enrique Trabanino and Kim Albrecht...Level 10 Ohio State Team Champions 2006-2010...All-around, beam and bars champion 2010...Region 5 beam Champion 2009...Qualified to Junior Olympic Level 10 Nationals in 2007, 2009-10...Part of team that won Junior Olympic Nationals in 2007...Team Captain in 2009 and 2010. Personal: Daughter of Renee and Len Cosentino...Born May 12, 1992 in Cleveland, Ohio...Has three sisters and one brother. Acacia Cosentino's Personal Bests Vault: 9.600 - 4/2/11 - Norman, Okla. Uneven Bars: 9.750 - 2/17/12 - Chapel Hill, N.C. Floor Exercise: 9.725 - 4/2/11 - Norman, Okla. Getting To Know Acacia:  Nickname: Caish Major: Double major in English and Philosophy Career Plans: Teaching or advising What is the best thing about being at UNC? The Tar Heel family Away from gymnastics and academic pursuits, I like to spend time… Cooking, watching Disney movies, going to Athletes in Action, and trying new restaurants and sing alongs. My greatest strength as a gymnast is… persevering through adversity Biggest sports thrill and why? 2011 UNC Men’s Soccer National Championship Person who had the greatest influence on your career and why: My parents because they are so selfless in helping me achieve my goals Favorite book: Jane Eyre by Charlotte Brante Favorite food: Cosentino pasta Funny or interesting fact about yourself: My nephew’s name is Dean Smith Favorite class at UNC and why: 19th Century British Literature because we read great novels At what age did you start participating in gymnastics and what is your earliest memory of gymnastics: Age 6, and I remember not knowing I was called up to the awards stand because my name was so badly mispronounced The funniest nickname on the team belongs to: Sarah Peterson- Pete What song would you sing if you were on American Idol: Bohemian Rhapsody by Queen What reality show would you most like to be on? Say Yes to the Dress My favorite guilty pleasure is: Peanut M&M’s If I could go to dinner with one famous person it would be: C.S. Lewis The most interesting person I’ve met at UNC is: Mike and Kim Echstenkamper People say I look like… a cartoon character Favorite place to visit: the beach"
        }
    },
    {
        "pk": 5,
        "model": "team.Player",
        "fields": {
            "name": "Michelle Ikoma",
            "position": "AA",
            "year": "RSr.",
            "hometown": "Naperville, Ill.",
            "high_school": "Naperville",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/SI/SIRQDWDCZTHIWCB.20131127180057.jpg",
            "story": "As a Junior Named one of 10 finalists for the 2013 Arthur Ashe Jr. Sports Scholar Award • Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team for the fourth straight season • Competed in all 12 meets primarily on vault, bars and floor exercise • Did not compete on bars until the fourth meet of the season • Hit a near flawless routine and posted a 9.850 to finish second at NC State • Won the bars event with a 9.80 at George Washington • Posted her season-best score on floor with a 9.850 at Pitt to tie for fourth place • Had a season-high 9.750 on vault in three meets, including the NCAA regionals and EAGL championships. As a Sophomore Named an Arthur Ashe Scholar Award winner • Earned EAGL All-Academic honors • Came back to the lineup to compete in nine events primarily in vault and floor • Scored a season-high 9.750 on floor exercise to finish sixth vs. Maryland • Scored a season-best 9.725 at the NCAA Regional. 2011 Ikoma tore the Achilles tendon in her right foot in practice in January just before the start of the 2011 season. She redshirted and will have three years of eligibility remaining. Ikoma has completely recovered and will be competing this season. As a Freshman Competed in all 11 events and was a valuable contributor on all events • Began the season with a fourth place finish on the uneven bars at the George Washington Invitational • Finished second on the vault with a 9.750 at William & Mary • Scored a season-high 9.775 and finish fourth on vault vs. Maryland • Competed in the all-around for the first time in her career at the Sweetheart Invitational and scored a 37.700 • Had a season-high 9.725 on bars and a personal-best 38.425 in all-around at Florida • Posted a season-best 9.775 on vault vs. West Virginia and a personal-best 9.775 on floor exercise vs. Rutgers • Received EAGL All-Academic honors. Prep: Trained with Dan & Beth Miller at Arena Gymnastics in Joliet, Ill. ... Attended Naperville Central High School in Naperville, Ill. ... 2007 and 2008 USA Gymnastics Junior Olympic Nationals qualifier ... Was the 2007 Region 5 all-around, balance beam and uneven bars champion ... Placed seventh on uneven bars and 14th in the all-around at the 2007 Junior Olympic National Championships ... Placed fourth on uneven bars, sixth on vault and sixth in the all-around at the 2008 USA Gymnastics Junior Olympic Level 10 Nationals. Personal: Daughter of Allan and Denise Ikoma ... Born on March 19, 1991 in Chicago, Ill. ... Given name is Michelle Mariko Ikoma ... Has a sister, Danielle (20) who is a member of the Stanford gymnastics team and a brother, Derek (15) ... Plans to major in biomedical engineering and economics ... Enjoys shopping, cryptograms and Dance Dance Revolution. Personal Bests Vault: 9.775 (twice) - most recently on 3/13/10 - Chapel Hill, N.C. Uneven Bars: 9.850 - 2/16/13 at NC State Balance Beam: 9.650 - 2/20/10 - Raleigh, N.C. Floor Exercise: 9.850 - 3/2/13 at Pitt  All-Around: 38.425 - 3/5/10 - Gainesville, Fla. Getting To Know Michelle:  Nickname: Mich, Michine Major: Business Administration, Exercise & Sports Science; Minor: Mathematics Career Plans: Short-Term: Earn a Master of Science in Data Analysis; Long-Term: Merge my interests in data analysis and rehabilitative medicine to help develop prosthetics that amputees can control just like their own arm/leg What is the best thing about being at UNC? Having an amazing family of people around you who are always there to support you and do anything they can to help you succeed My greatest strength as a gymnast is… My work ethic and enthusiasm Biggest sports thrill and why? Winning back-to-back EAGL Championships my freshman and sophomore year Person who had the greatest influence on your career and why: My sister, Danielle. Growing up, I always wanted to be just like her, and to this day, I know that I can always go to her for advice and support Favorite Book: My Sister’s Keeper by Jodi Picoult Funny or interesting fact about yourself: I was a “kid scientist” on the Late Show with David Letterman when I was in 8th grade Favorite class at UNC and why: EXSS 380- Neuromuscular Control and Training; I find it fascinating to learn about how basic components of the nervous system and muscular system work together seamlessly in everything we do without us even thinking about it.At what age did you start participating in gymnastics and what is your earliest memory of gymnastics? Age 3; I remember getting separated from my group when I was 4 or 5 and looking around in panic, then seeing my sister in her group (which was a completely different class), and then running over to join her The funniest nickname on the team belongs to: Megan- M&M What song would you sing if you were on American Idol? I can’t sing, so I would never be on American Idol to begin with, but I love the song “Hall of Fame” by The Script [feat. Will I Am] What reality show would you most like to be on? The Amazing Race My favorite guilty pleasure is: Bski’s warm chocolate chip cookies If I could go to dinner with one famous person it would be: Thomas Edison The most interesting person I’ve met at UNC is: Meredith Petschauer (I’m convinced she’s super woman because she does a billion different things, yet does them all well). People say I look like… Ashley Dai on the tennis team"
        }
    },
    {
        "pk": 5,
        "model": "team.Player",
        "fields": {
            "name": "Josselyn Mackey",
            "position": "AA",
            "year": "So.",
            "hometown": "Lee's Summit, Mo.",
            "high_school": "Lee's Summit Morth",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/MM/MMPOUVAEMBUTQCY.20131127180057.jpg",
            "story": "As a Freshman Selected to the EAGL All-Academic team • Competed in every meet on balance beam • Also was a regular in the uneven bars and vault lineup • Competed on floor in just two meets • Had her season-high score on vault with a 9.600 at home against George Washington and on the road at Maryland • Posted a season-best 9.800 on the balance beam to finish second in the home meet vs. Maryland • Showed steady progress on the uneven bars and posted season-highs of 9.800 in back-to-back meets against Oklahoma and Penn. Prep: Attended Lee's Summit North High School in Lee's Summit, Mo. • Trained at Xtreme Gymnastics under the guidance of Alisha Robinson • Four-time Junior Olympic National Qualifier • Placed second at the 2012 Junior Olympic national championships • Placed sixth on balance beam at the 2011 National Championships • Placed 10th on balance beam and 12th in the all-around at 2010 National Championships. Personal Bests: Vault: 9.600 - 1/26 at Maryland Uneven Bars: 9.800 - 3/10/13 at Oklahoma; 3/16/13 vs. Penn Balance Beam: 9.800 - 2/2/13 vs. Maryland Getting To Know Josselyn:  Nickname: Joss Major: undecided Career Plans: undecided What is the best thing about being at UNC? Carolina Blue Away from gymnastics and my academic pursuits, I like to spend time… with my teammates My greatest strength as a gymnast is: Loving the sport even when things get hard and frustrating Biggest sports thrill and why? Competing for UNC Person who had the greatest influence on your career and why: Parents. They were always supportive no matter how well I did. Favorite Book: Anything turned into a movie so I don’t have the read the book Favorite Food: Breakfast food Funny or interesting fact about yourself: I am absolutely terrible at any other sport Favorite class at UNC and why: Practice- It’s the best part of my day At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? I’ve been in the gym as long as I can remember. I remember practicing backhand springs at home on my trampoline The funniest nickname on the team belongs to: Sarah Peterson- Frisk What song would you sing if you were on American Idol? N/A What reality show would you most like to be on? Wipeout My favorite guilty pleasure is: napping If I could go to dinner with one famous person it would be: Ashton Kutcher The most interesting person I’ve met at UNC is: the pit preacher People say I look like… Haley Watts Favorite place to visit: the beach"
        }
    },
    {
        "pk": 6,
        "model": "team.Player",
        "fields": {
            "name": "Meredith Magjuka",
            "position": "BB, FX",
            "year": "RSr.",
            "hometown": "Greenwood, Ind.",
            "high_school": "Center Grove",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/GW/GWOJWYZKVZIHFXH.20131127180057.jpg",
            "story": "As a Junior Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team for the fourth straight season • Competed in all 12 meets primarily on vault, balance beam and floor exercise • Had her best meet of the season at home vs. Maryland with season highs on the vault (9.700) and floor (9.800) • Posed a season-best 9.850 on the balance beam against NC State and Pitt to finish third • Also placed third on balance beam with a 9.750 at George Washington in the first meet of the season. As a Sophomore Competed on floor exercise in three meets - at George Washington, vs. William & Mary and at Alabama • Scored a season-best 9.100 on floor at George Washington • Earned EAGL All-Academic honors. As a Freshman Competed in four meets after returning to competitive action following a redshirt season in 2010 • Competed on vault and floor at the first two meets of the season at the George Washington Invitational and at Rutgers • Was part of the floor lineup at William & Mary and at home vs. Maryland • Scored a personal-best 9.575 on floor at Rutgers • Posted a season-high 9.500 at George Washington • Received EAGL All-Academic honors. In 2010 Redshirted in 2010 after fracturing a vertebrae in her back • Competed on uneven bars and balance beam at George Washington Invitational and William & Mary prior to the injury • Scored personal-bests on bars (9.650) and balance beam (9.650) in George Washington Invitational. Prep: A top student at Center Grove High School ... Trained under the guidance of Michelle Hart and Casey Wright at Wright's Gymnastics Academy in Greenwood, Ind. ... Three-time USA Gymnastics Junior Olympic National Champion ... Achieved the ultimate as a Level 10 gymnast competitively at the 2007 Junior Olympic National Championships when she won the floor exercise title ... Repeated that achievement, and even went a step further, in 2008 when she was crowned as the floor exercise and all-around champion at the USA Gymnastics Junior Olympic National Championships. Personal: Daughter of Rich and Annette Magjuka ... Born on November 11, 1990 in Greenwood, Ind. ... Given name is Meredith Anne Magjuka ... Has one sister, Marianne and one brother, David ... Enjoys cooking and watching football with her dad ... Enrolled in General College. Personal Bests Uneven Bars: 9.650 - 1/17/10 - Washington, D.C. Balance Beam: 9.850 - 2/16/13 - at NC State Vault: 9.7000 - 2/2/13 - vs. Maryland Floor: 9.800 - 2/2/13 - vs. Maryland Getting To Know Meredith:  Major: Business Administration Career Plans: Consulting Best thing about UNC: The diversity of opportunities available I like to spend my free time… doing hot yoga and cooking My greatest strength as a gymnast… resiliency Biggest sports thrill… winning J.O. nationals Person with the greatest influence on your career: My family for always supporting and loving me unconditionally Favorite Book: Crime and Punishment Favorite Food: Spaghetti Squash Funny Fact: I can’t ride a bike Favorite Class: Environmental Justice What age did you start participating in gymnastics: 2 What song would you sing if you were on American Idol? I really can’t sing If I could go to dinner with one famous person it would be: Martin Luther King Jr. Favorite place to visit: Home"
        }
    },
    {
        "pk": 7,
        "model": "team.Player",
        "fields": {
            "name": "Megan Marenghi",
            "position": "UB, BB",
            "year": "Fr.",
            "hometown": "Plano, Texas",
            "high_school": "",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/EA/EASPLHGYHXVSREB.20131127180057.jpg",
            "story": "Prep: An accomplished Level 10 gymnast and a strong student • Trained at Zenith Elite Gymnastics in Plano, Texas, with coaches Tatiana Schegolkova and Alex Atamas • Excelled on balance beam and uneven bars • A USA Gymnastics Junior Olympic National Team Member in 2010 and 2011 • Was the 2010 national champion on balance beam and also placed second on uneven bars and fourth in the all-around • Was the 2011 USA Gymnastics Region III all-around, uneven bars and balance beam champion • Placed second in the all-around, fourth on balance beam and sixth on uneven bars at the 2011 USA Gymnastics Junior Olympic National Championships. *** Getting To Know Megan: Nickname: Meg, Eminem Major: Global Studies Career Plans: Don’t know the specifics yet, but I definitely want a career in international relations, specifically America and the Middle East What is the best thing about being at UNC? Meeting new people and trying new things Away from gymnastics and my academic pursuits, I like to spend time… having fun with my friends and teammates My greatest strength as a gymnast is… rising to the occasion, performing under pressure Biggest sports thrill and why? Trying elite in 2012 because it was very gratifying to return to the level I was once at before having four knee surgeries Person who had the greatest influence on your career and why: My mom because she always helps me persevere and always gives me the best encouragement Favorite Book: The Hunger Games Favorite Food: Lobsters and mussels Funny or interesting fact about yourself: I can palm a basketball Favorite class at UNC and why: ENGL 72, which is a first year seminar about the literature of 9/11. I like learning about the relation between the U.S. and Middle East At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? 2; punching the beam when I would fall The funniest nickname on the team belongs to: Margaret Brown- Brownie What song would you sing if you were on American Idol? Rap God-Eminem What reality show would you most like to be on? Basketball Wives My favorite guilty pleasure is: coffee If I could go to dinner with one famous person it would be: Definitely Tom Brady The most interesting person I’ve bet at UNC is: My roommate Leslie Cloots who is a golfer from Belgium People say I look like: I’m just really unique I guess Favorite place to visit: Maui"
        }
    },
    {
        "pk": 8,
        "model": "team.Player",
        "fields": {
            "name": "Sarah Peterson",
            "position": "AA",
            "year": "So.",
            "hometown": "Huntington, N.Y.",
            "high_school": "Elwood/John Glenn",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/VO/VORSUWQJSZMXQQB.20131127180057.jpg",
            "story": "As a Freshman Competed in all 12 meets in at least two events • Was a regular member of the vault and floor lineups • Posted her best score of the season on uneven bars with a 9.775 to finish fourth against Maryland and fifth at George Washington • Had a season-high 9.800 on vault against Maryland • Matched that score later in the season to finish tied for ninth at the EAGL championships • Scored a 9.825 on floor vs. Penn to take home third place honors. Prep: Attended Elwood/John Glenn High School in Elwood, N.Y...Trained at Mid Island Gymnastics under the direction of Travol Williams...Junior Olympic Nationals Qualifier 2010...Two-time Eastern Nationals Qualifier...Placed eighth in the all-around at the Eastern Nationals in 2009...Foot injury in 2011 that kept her from completing the competitive season. Personal Bests: Vault: 9.800 - 3/2/13 vs. Maryland; 3/23/13 at EAGL championships Uneven Bars: 9.775 - 1/20/13 vs. George Washington; 3/2/13 vs. Maryland Floor Exercise: 9.825 - 3/16/13 vs. Penn Getting to Know Sarah:  Nickname: Frisk/ Pete What is the best thing about being at UNC? Meeting new people Away from gymnastics and my academic pursuits, I like to spend time… With my friends My greatest strength as a gymnast is… staying calm Biggest sports thrill and why? Competing because I finally get a chance to show my routines that I have been training Favorite Book: The Hunger Games Favorite Food: Ice Cream At what age did you first participating in gymnastics and what is your earliest memory of gymnastics? 6; my first Girl Scout trip to the gym The funniest nickname on the team belongs to: Margie- Brownie What song would you sing if you were on American Idol? Born Stunna Remix What reality show would you most like to be on? The Bachelorette My favorite guilty pleasure is: reality TV If I could go to dinner with one famous person it would be: John Mayer (preferably a date) The most interesting person I’ve met at UNC is: The Joss Mackey Favorite place to visit: beach"
        }
    },
    {
        "pk": 9,
        "model": "team.Player",
        "fields": {
            "name": "Christina Pheil",
            "position": "AA",
            "year": "Fr.",
            "hometown": "St. Petersburg, FL",
            "high_school": "St. Petersburg",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/XG/XGVVMGKCUIEYTQC.20131127180057.jpg",
            "story": "Prep:Trained under the guidance of Brad Harris and Amy Schulthess at Tampa Bay Turners Gymnastics in St. Petersburg, Fla. • During her Junior Olympic career she was the Florida State all-around champion at every level for levels 4-10 • Was the 2009 USA Gymnastics Level 9 Eastern National all-around and uneven bars champion • Placed fourth on floor exercise and 19th in the all-around at the 2010 USA Gymnastics Junior Olympic Level 10 National Championships • Was the 2011 Junior Olympic National Invitational Tournament floor exercise champion. Getting to Know Christina: Nickname: Chris/Pheil Major: Exercise and Sports Science and Pre-Pharmacy Career Plans: Enter the pharmacy program at UNC and then pursue pharmacology What is the best thing about being at UNC? The spirit that everyone displays and how people care so deeply about this school Away from gymnastics and my academic pursuits, I like to spend time… playing other sports, listening to music and reading My greatest strength as a gymnast is… Being focused, composed and committed towards myself, but more importantly, to the team Biggest sports thrill and why? When someone nails a skill or routine…that gives me chills Person who had greatest influence on your career and why: My parents because no matter what, they are always support me, listening to me and encouraging me Favorite Book: The Great Gatsby Favorite Food: Sushi Funny or interesting fact about yourself: I can do donuts on a jet ski Favorite class at UNC and why: Philosophy 112 “Making Sense of Yourself” because the class makes me think of things I have never even thought about thinking about At what age did you first start participating in gymnastics and what is your earliest memory of gymnastics? 3 years old. My parents caught me climbing the refrigerator, and once I broke the handle they decided to put me in gymnastics The funniest nickname on the team belongs to: Sarah Peterson- Pete What song would you sing if you were on American Idol? Hold On We’re Going Home by Drake (Duet with Margie) What reality show would you most like to be on? Punk’dMy favorite guilty pleasure is: Christmas music If I could go to dinner with one famous person it would be: Harry Styles The most interesting person I’ve met at UNC is: Leslie Cloots People say I look like… Christina Pheil Favorite place to visit: St. Pete Beach"
        }
    },
    {
        "pk": 10,
        "model": "team.Player",
        "fields": {
            "name": "Janell Sargent",
            "position": "BB",
            "year": "Jr.",
            "hometown": "Greenville, N.C.",
            "high_school": "",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/UV/UVTCREJCKAUOSTW.20131127180057.jpg",
            "story": "As a Sophomore Named a Scholastic All-America by the National Association of Collegiate Gymnastics Coaches • Selected to the EAGL All-Academic team • Competed in all 12 meets as a balance beam specialist • Posted a season-high 9.900 to finish second at NC State and Pittsburgh • Posted a score of 9.700 or higher in nine of 12 meets on beam • Tied for second in the beam competition in the meet at George Washington and at Pitt. As a Freshman Competed in seven meets as part of the balance beam lineup • Posted a season-best 9.750 in a road meet at Penn State and at the NCAA Regional in Raleigh • Also had a 9.725 on three occasions - vs. Temple on Feb. 17, George Washington on Feb. 24 and at the EAGL Championship on March 24 • Earned EAGL All-Academic honors. Prep Was one of the top Junior Olympic gymnasts in North Carolina for many years • Attended Roses' Gymnastics in Greenville, N.C., where she trained under the guidance of Darlene Rose, Colin Womack and Shelley Harris • Two-time USA Gymnastics Junior Olympic Level 10 National qualifier • Roses' training program has produced several outstanding student athletes that pursued their college experiences at Carolina. Personal Born Janell Elizabeth Sargent on January 1, 1993 in Minneapolis • Daughter of Andy and Pam Sargent • Was home schooled by her parents • Volunteered twice a month at Reimage Church in the children's curriculum • Played the violin as a child • Her father, Andy, is a chemistry professor at East Carolina University. Personal Bests: Balance Beam: 9.900 - 2/16/13 at NC State Getting To Know Janell:  Nickname: Nell Major: Exercise and Sports Science; Minor: Hispanic Studies Career Plans: Still praying about it What is the best thing about being at UNC? Getting to meet and befriend so many people! The is always someone to talk to Away from gymnastics and academic pursuits, I like to spend time… reading my Bible, praying, going to FCA, Summit and Bible Study, cooking with teammates, and going to other sporting events at UNC My greatest strength as a gymnast is… Being able to focus on what I’m doing in the gym. Being able to fully “zone in” on what I’m doing. Biggest sports thrill and why? Probably getting my first 38AA score in level 8. I was so excited to finally break through that 38.00 barrier, and it was a solid meet overall. I felt really good about it. Person who had the greatest influence on your career and why: There are so many people who have influenced my gymnastics career in big ways, but I want to give a shout out to my parents. They have sacrificed so much of their time and money to enable me to compete in gymnastics, have always been supportive, and have encouraged me to do my best while never ever forcing me to continue doing it. I am so grateful to them! Favorite book: the BibleFavorite food: Just about any kind of grilled vegetable, especially asparagusFunny or interesting fact about yourself: I only had 2 wisdom teeth that grew in and had to get taken out. My poor mom had 5, so we always joke that she took an extra of mine for me Favorite class at UNC and why: I love my EXSS 188 Emergency Care class. I am excited to keep learning about how to treat people and give proper care in emergency situations. I love feeling prepared to step up in these situations an be able to help people in every way that I can At what age did you start participating in gymnastics and what is your earliest memory of gymnastics? I started gymnastics at 3 ½. One of my earliest memories of gymnastics is coming into the gym with my teammates for very early-morning interviews/news specials featuring our local gym, Rose’s Gymnastics. I got so nervous about the interviews because I was extremely shy when I was younger, but I had fun coming in and doing gymnastics in the early morning with my team anyway! The funniest nickname on the team belongs to: Margaret- Brownie What song would you sing if you were on American Idol? The Motions b Matthew West What reality show would you most like to be on? I think it would be fun and very rewarding to be on the Extreme Makeover: Home Edition team My favorite guilty pleasure is: Any sort of ice cream with other things mixed in (brownie bites, cookie dough pieces, caramel swirl, etc.) If I could go to dinner with one famous person it would be: Alex Kendrick. He may not be super famous, but he has produced several movies (Facing the Giants, Fireproof, Flywheel and Courageous) of which I am a big fan! The most interesting person I’ve met at UNC is: Adeline Dorough- she always has so much energy. She also loved God and is just an awesome person People say I look like… My dad. People can always tell we’re related Favorite Place to visit: Maine and Texas, where my extended family lives"
        }
    },
    {
        "pk": 10,
        "model": "team.Player",
        "fields": {
            "name": "Haley Watts",
            "position": "AA",
            "year": "Jr.",
            "hometown": "Charlotte, N.C.",
            "high_school": "Providence",
            "imgurl": "http://image.cdnllnwnl.xosnetwork.com/pics33/400/FV/FVCWIDURUBFOLEG.20131127180057.jpg",
            "story": "One of the most consistent performers on the team • Had a strong sophomore season and has a bright future. As a Sophomore Battled teammate Elizabeth Durkac for top all-around scores every week • Took home EAGL Gymnast of the Week honors after posting a 39.225 in the all-around competition vs. Maryland to finish first • Also scored more than a 39.0 in the all-around at NC State, at Oklahoma, vs. Penn and at the EAGL championships • Scored a 39.0 at both the EAGL championships and the NCAA regionals to place ninth in both meets • Scored season-highs on vault (9.850) and floor (9.850) against the Terps • Finished first on the floor in that meet • Also had a 9.850 on floor at NC State • Recorded season-highs on bars with a 9.850 at Oklahoma at vs. Penn • Finished in second place on bars vs. the Quakers • Had a season-high 9.775 on balance beam in two different meets. As a Freshman Competed in all 11 meets • Competed on balance beam, floor exercise and vault • Had her best meet at the NCAA Regional in Raleigh with season-highs on vault (9.775) and balance beam (9.750) • Had a season-high 9.825 on floor exercise to place eighth at Penn State • Finished fourth vs. William & Mary with a 9.750 on floor exercise. Prep Has been one of the top gymnasts in North Carolina for the past several years • Trained under the direction of Ludmilla Shobe at Southeastern Gymnastics • Has been involved in gymnastics since the age of 3 • Was a 2008, 2009, and 2010 Level 10 Junior Olympic National Qualifier • Placed 10th in the All-Around in 2008 & 2009, and she finished fifth in the All-Around in 2010 at the USA Gymnastics Junior Olympic National Championships. Personal Born Haley Brook Watts on September 19, 1993 in Lexington, N.C. • Daughter of Laura Lilly and Kevin Watts. Personal Bests: Vault: 9.850 - 2/2/13 vs. Maryland Uneven Bars: 9.850 - 3/10/13 at Oklahoma; 3/16/13 vs. Penn Balance Beam: 9.775 - 1/20/13 vs. George Washington; 3/23/13 at EAGL championships Floor Exercise: 9.850 - 2/2/13 vs. Maryland; 2/16/13 at NC State All-Around: 39.225 - 2/2/13 vs. Maryland Getting To Know Haley:  Major: Communications Career Plans: Elementary school teacher What is the best thing about being at UNC? All the great memories we are making Away from gymnastics and my academic pursuits, I like to spend time… with friends My greatest strength as a gymnast is… staying calm Biggest sports thrill and why? N/A Person who had the greatest influence on your career and why: My mom, she has always been there to support me Favorite Book: The Girl with the Dragon Tattoo Favorite Food: Oodles n Noodles Funny or interesting fact about yourself: N/A Favorite class at UNC and why: COMM 260- Performance and Social Change because we get to freely address cont
